//
// Created by acryoz on 5/10/24.
//

#ifndef LAB5_HEADERS_LAYOUTS_H_
#define LAB5_HEADERS_LAYOUTS_H_


static const int SHIFT_OFFSET = 47;
static const int BUTTON_QUANTITY = 47;

static const int NUMBER_ROW = 13;
static const int FIRST_ROW = 13;
static const int SECOND_ROW = 11;
static const int THIRD_ROW = 10;

static const int LAYOUT_NUMBER = 8;

static const int NUMBER_ROW_CUMULATIVE = 0;
static const int FIRST_ROW_CUMULATIVE = 13;
static const int SECOND_ROW_CUMULATIVE = 26;
static const int THIRD_ROW_CUMULATIVE = 37;

static const QVector<QString> arabic = {
    "ذ",  "1",  "2", "3", "4", "5",  "6",  "7", "8", "9", "0", "-",
    "=",  "ض",  "ص", "ث", "ق", "ف",  "غ",  "ع", "ه", "خ", "ح", "ج",
    "د",  "\\", "ش", "س", "ي", "ب",  "ل",  "ا", "ت", "ن", "م", "ك",
    "ط",  "ئ",  "ء", "ؤ", "ر", "لا", "ى",  "ة", "و", "ز", "ظ",

    "ّ",   "!",  "@", "#", "$", "%",  "^",  "&", "*", ")", "(", "_",
    "+",  "َ",   "ً",  "ُ",  "ٌ",  "لإ", "إ",  "`", "÷", "×", "؛", "<",
    ">",  "|",  "ِ",  "ٍ",  "]", "[",  "لأ", "أ", "ـ", "،", "/", ":",
    "\"", "~",  "ْ",  "}", "{", "لآ", "آ",  "'", ",", ".", "؟",
};

static const QVector<QString> english = {
    "`",  "1",  "2", "3", "4", "5", "6", "7", "8", "9", "0", "-",
    "=",  "q",  "w", "e", "r", "t", "y", "u", "i", "o", "p", "[",
    "]",  "\\", "a", "s", "d", "f", "g", "h", "j", "k", "l", ";",
    "'",  "z",  "x", "c", "v", "b", "n", "m", ",", ".", "/",

    "~",  "!",  "@", "#", "$", "%", "^", "&", "*", "(", ")", "_",
    "+",  "Q",  "W", "E", "R", "T", "Y", "U", "I", "O", "P", "{",
    "}",  "|",  "A", "S", "D", "F", "G", "H", "J", "K", "L", ":",
    "\"", "Z",  "X", "C", "V", "B", "N", "M", "<", ">", "?",
};

static const QVector<QString> russian = {
    "ё", "1",  "2",  "3", "4", "5", "6", "7", "8", "9", "0", "-",
    "=", "й",  "ц",  "у", "к", "е", "н", "г", "ш", "щ", "з", "х",
    "ъ", "\\", "ф",  "ы", "в", "а", "п", "р", "о", "л", "д", "ж",
    "э", "я",  "ч",  "с", "м", "и", "т", "ь", "б", "ю", ".",

    "Ё", "!",  "\"", "№", ";", "%", ":", "?", "*", "(", ")", "_",
    "+", "Й",  "Ц",  "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З", "Х",
    "Ъ", "/",  "Ф",  "Ы", "В", "А", "П", "Р", "О", "Л", "Д", "Ж",
    "Э", "Я",  "Ч",  "С", "М", "И", "Т", "Ь", "Б", "Ю", ",",
};

static const QVector<QString> belorussian = {
    "ё", "1",  "2",  "3", "4", "5", "6", "7", "8", "9", "0", "-",
    "=", "й",  "ц",  "у", "к", "е", "н", "г", "ш", "ў", "з", "х",
    "'", "\\", "ф",  "ы", "в", "а", "п", "р", "о", "л", "д", "ж",
    "э", "я",  "ч",  "с", "м", "і", "т", "ь", "б", "ю", ".",

    "Ё", "!",  "\"", "№", ";", "%", ":", "?", "*", "(", ")", "_",
    "+", "Й",  "Ц",  "У", "К", "Е", "Н", "Г", "Ш", "Ў", "З", "Х",
    "'", "/",  "Ф",  "Ы", "В", "А", "П", "Р", "О", "Л", "Д", "Ж",
    "Э", "Я",  "Ч",  "С", "М", "І", "Т", "Ь", "Б", "Ю", ",",
};

static const QVector<QString> german = {
    "^", "1", "2",  "3", "4", "5", "6", "7", "8", "9", "0", "ß",
    "´", "q", "w",  "e", "r", "t", "z", "u", "i", "o", "p", "ü",
    "+", "#", "a",  "s", "d", "f", "g", "h", "j", "k", "l", "ö",
    "ä", "y", "x",  "c", "v", "b", "n", "m", ",", ".", "-",

    "°", "!", "\"", "§", "$", "%", "&", "/", "(", ")", "=", "?",
    "`", "Q", "W",  "E", "R", "T", "Z", "U", "I", "O", "P", "Ü",
    "*", "'", "A",  "S", "D", "F", "G", "H", "J", "K", "L", "Ö",
    "Ä", "Y", "X",  "C", "V", "B", "N", "M", ";", ":", "_",
};


static const QVector<QString> french = {
    "²", "&", "é", "\"", "'", "(", "-", "è", "_", "ç", "à", ")",
    "=", "a", "z", "e",  "r", "t", "y", "u", "i", "o", "p", "^",
    "$", "*", "q", "s",  "d", "f", "g", "h", "j", "k", "l", "m",
    "ù", "w", "x", "c",  "v", "b", "n", ",", ";", ":", "!",

    "~", "1", "2", "3",  "4", "5", "6", "7", "8", "9", "0", "°",
    "+", "A", "Z", "E",  "R", "T", "Y", "U", "I", "O", "P", "¨",
    "£", "µ", "Q", "S",  "D", "F", "G", "H", "J", "K", "L", "M",
    "%", "W", "X", "C",  "V", "B", "N", "?", ".", "/", "§",
};

static const QVector<QString> hebrew = {
    ";",  "1",  "2", "3", "4", "5", "6", "7", "8", "9", "0", "-",
    "=",  "/",  "'", "ק", "ר", "א", "ט", "ו", "ן", "ם", "פ", "]",
    "[",  "\\", "ש", "ד", "ג", "כ", "ע", "י", "ח", "ל", "ך", "ף",
    ",",  "ז",  "ס", "ב", "ה", "נ", "מ", "צ", "ת", "ץ", ".",

    "~",  "!",  "@", "#", "$", "%", "^", "&", "*", ")", "(", "_",
    "+",  "Q",  "W", "E", "R", "T", "Y", "U", "I", "O", "P", "}",
    "{",  "|",  "A", "S", "D", "F", "G", "H", "J", "K", "L", ":",
    "\"", "Z",  "X", "C", "V", "B", "N", "M", ">", "<", "?",
};

static const QVector<QString> chinese = {
    "`",  "1",  "2", "3", "4", "5", "6", "7", "8", "9", "0", "-",
    "=",  "q",  "w", "e", "r", "t", "y", "u", "i", "o", "p", "[",
    "]",  "\\", "a", "s", "d", "f", "g", "h", "j", "k", "l", ";",
    "'",  "z",  "x", "c", "v", "b", "n", "m", ",", ".", "/",

    "~",  "!",  "@", "#", "$", "%", "^", "&", "*", "(", ")", "_",
    "+",  "Q",  "W", "E", "R", "T", "Y", "U", "I", "O", "P", "{",
    "}",  "|",  "A", "S", "D", "F", "G", "H", "J", "K", "L", ":",
    "\"", "Z",  "X", "C", "V", "B", "N", "M", "<", ">", "?",
};
static const QVector<QVector<QString>> layouts = {
    english, russian, belorussian, german, french, hebrew, chinese, arabic,
};
#endif  //LAB5_HEADERS_LAYOUTS_H_
